Revit 2015 API
TextNoteTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual TextNoteTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As TextNoteTypeSetIterator
Visual C++
public:
virtual TextNoteTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
TextNoteTypeSet Class
Autodesk.Revit.DB Namespace